<template>
    <section class="medist-faq">
        <div class="breadcrumbs">
            <v-breadcrumbs :items="items" />
        </div>
        <div class="faq">
            <div class="tabs">
                <ul class="lists">
                    <li @click="tab = 1" class="mr-4 pb-2 list medist-cursor-pointer" :class="tab == 1 ? 'medist-faq-tab' : '' ">رزور نوبت</li>
                    <li @click="tab = 2" class="mr-4 pb-2 list medist-cursor-pointer" :class="tab == 2 ? 'medist-faq-tab' : '' ">تخصص ها</li>
                    <li @click="tab = 3" class="mr-4 pb-2 list medist-cursor-pointer" :class="tab == 3 ? 'medist-faq-tab' : '' ">پزشکان</li>
                    <li @click="tab = 4" class="mr-4 pb-2 list medist-cursor-pointer" :class="tab == 4 ? 'medist-faq-tab' : '' ">ویزیت</li>
                </ul>
            </div>
            <div class="tabs-mobile">
                <ul class="lists">
                    <li @click="tab = 1" class="mr-4 list" :class="tab == 1 ? 'medist-faq-tab-active' : 'primary--text' ">رزور نوبت</li>
                    <li @click="tab = 2" class="mr-4 list" :class="tab == 2 ? 'medist-faq-tab-active' : 'primary--text' ">تخصص ها</li>
                    <li @click="tab = 3" class="mr-4 list" :class="tab == 3 ? 'medist-faq-tab-active' : 'primary--text' ">پزشکان</li>
                    <li @click="tab = 4" class="mr-4 list" :class="tab == 4 ? 'medist-faq-tab-active' : 'primary--text' ">ویزیت</li>
                </ul>
            </div>
            <div class="expansion-panels">
                <div v-if="tab == 1">
                    <v-expansion-panels flat class="expansion">
                        <v-expansion-panel v-for="(item,i) in expandPanelItem" :key="i" class="panel">
                        <v-expansion-panel-header expand-icon="mdi-chevron-down-circle-outline" class="expansion-head">
                            {{ item.header }}
                        </v-expansion-panel-header>
                        <v-expansion-panel-content class="expansion-text">
                            {{ item.title }}
                        </v-expansion-panel-content>
                        </v-expansion-panel>
                    </v-expansion-panels>
                </div>
                <div v-if="tab == 2">
                    تخصص ها
                </div>
                <div v-if="tab == 3">
                    پزشکان
                </div>
                <div v-if="tab == 4">
                    ویزیت
                </div>
            </div>
        </div>
    </section>
</template>

<script>
    export default {
        mounted(){
            this.tab = 1
        },
        data(){
            return{
                tab:[1,2,3,4],
                show: 0,
                items:[
                    { text:'خانه', disabled:false, to:'index' },
                    { text:'سوالات متداول', disabled:true, to:'/public/faq' },
                ],
                expandPanelItem:[
                    { header:'برای گرفتن نوبت باید چکار کنیم', title:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.' },
                    { header:'آیا هزینه برقرای تماس تلفنی هم برای من محسوب می شود؟ آیا باید هزینه تماس را روی قبض خود بپردازم ؟', title:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.' },
                    { header:'آیا هزینه برقرای تماس تلفنی هم برای من محسوب می شود؟ آیا باید هزینه تماس را روی قبض خود بپردازم ؟', title:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.' },
                    { header:'برای گرفتن نوبت باید چکار کنیم', title:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.' },
                    { header:'آیا هزینه برقرای تماس تلفنی هم برای من محسوب می شود؟ آیا باید هزینه تماس را روی قبض خود بپردازم ؟', title:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.' },
                    { header:'آیا هزینه برقرای تماس تلفنی هم برای من محسوب می شود؟ آیا باید هزینه تماس را روی قبض خود بپردازم ؟', title:'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.' },
                ],
            }
        }
    }
</script>

<style lang="scss" scoped>
.fade-up-enter-active,
.fade-up-leave-active {
  transition: all 0.3s ease-in-out;
}
.fade-up-enter,
.fade-up-leave-to {
  height: 0;
  transform: translateY(30px);
  opacity: 0;
}
</style>