<template>
    <section class="medist-journal">
        <div class="breadcrumbs">
            <v-breadcrumbs :items="items" />
        </div>
        <div class="content">
            <div class="header-content">
                <div class="text">تاثیر ژنتیک بر بیماری خود ایمنی</div>
                <div class="text1">دسته بندی: {{ this.$route.params.id }}</div>
            </div>
            <div class="header">
                <div class="user">
                    <img :src="avatar" alt="" class="avatar">
                    <div class="name">سعید قادری</div>
                </div>
                <div class="study">
                    <div class="study-timer">
                        <v-icon class="ml-2" color="primary">mdi-clock</v-icon>
                        مدت زمان مطالعه: {{ studyTimer }}
                    </div>
                    <div class="create-date">
                        <v-icon class="ml-2" color="primary">mdi-clock</v-icon>
                        {{ createDate }}
                    </div>
                </div>
            </div>
            <div class="banner">
                <img :src="banner" class="img" >
                <div class="head">آنچه در این مقاله خواهید خواند</div>
                <ul class="lists">
                    <li class="list">آنچه در این مقاله خواهید خواند</li>
                    <li class="list">آنچه در این مقاله خواهید خواند</li>
                    <li class="list">آنچه در این مقاله خواهید خواند</li>
                    <li class="list">آنچه در این مقاله خواهید خواند</li>
                </ul>
            </div>
            <div class="journals">
                <div class="journal" v-for="(item, i) in 3" :key="i">
                    <div class="head">آنچه در این مقاله خواهید خواند</div>
                    <img :src="postImg" alt="" align="left" class="img">
                    <img :src="postImg" alt="" align="left" class="journal-img">
                    <div class="text">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                    </div>
                </div>
                <div class="likes">
                    <div class="like">
                        <img src="/assets/icons/public/like.png" alt="">
                        {{ like }}
                    </div>
                    <div class="dislike">
                        <img src="/assets/icons/public/dislike.png" alt="">
                        {{ dislike }}
                    </div>
                </div>
                <div class="text">برچسب : {{ label }}</div>
            </div>
        </div>
        <div class="prospects">
            <div class="head">دیدگاه خود را بنویسید</div>
            <div class="prospect-main">
                <div class="row1">
                    <div>
                        <li class="text">نام و نام خانوادگی</li>
                        <v-text-field hide-details="" background-color="white" class="input" filled rounded />
                    </div>
                    <div>
                        <div class="text">شماره تماس</div>
                        <v-text-field hide-details="" background-color="white" class="input" filled rounded />
                    </div>
                </div>
                <div class="row2">
                    <div class="text">متن خود را وارد کنید</div>
                    <v-textarea filled rounded background-color="white" name="" id="" no-resize class="textarea" />
                </div>
                <v-btn depressed class="btn">ثبت نظر</v-btn>
            </div>
            <div class="prospect-total">
                <img src="/assets/icons/public/chat.png" alt="">
                <div class="text">نظرات</div>
            </div>
            <div class="text">{{ totalProspect }} دیدگاه ثبت شده است</div>
            <div class="prospect">
                <div class="prospect-user">
                    <img :src="avatar" alt="" class="avatar">
                    <div class="text">
                        <div class="name">سعید قادری</div>
                        <div class="date">12شهریور، ساعت 12:20</div>
                    </div>
                </div>
                <div class="desc">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
                </div>
                <div class="actions">
                    <div class="likes">
                        <img src="/assets/icons/public/like-gray.png" alt="">
                        <img src="/assets/icons/public/dislike-gray.png" alt="">
                    </div>
                    <v-btn class="btn" depressed>پاسخ دادن</v-btn>
                </div>
            </div>
            <div class="prospect-admin">
                <div class="prospect-user">
                    <img :src="avatar" alt="" class="avatar">
                    <div class="text">
                        <div class="name">مدیست</div>
                        <div class="date">12شهریور، ساعت 12:20</div>
                    </div>
                </div>
                <div class="desc">
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده،
                </div>
                <div class="actions">
                    <div class="likes">
                        <img src="/assets/icons/public/like-gray.png" alt="">
                        <img src="/assets/icons/public/dislike-gray.png" alt="">
                    </div>
                    <v-btn class="btn" depressed>پاسخ دادن</v-btn>
                </div>
            </div>
        </div>
    </section>
</template>

<script>
    export default {
        data(){
            return{
                dna:'/assets/images/journals/DNA.png',
                avatar:'/assets/images/avatar.png',
                banner:'/assets/images/journals/banner.png',
                postImg:'/assets/images/journals/postImg.png',
                studyTimer:'5دقیقه',
                createDate:'21 شهریور، ساعت 13:45',
                like:'15',
                dislike:'2',
                totalProspect:18,
                label:'پزشکی، کرونا، ژنتیک',
                items:[
                    { text:'خانه', disabled:false, to:'index' },
                    { text:'مقالات', disabled:false, to:'/public/journals' },
                    { text:'عنوان مقاله', disabled:true, to:'' },
                ]
            }
        }
    }
</script>

<style lang="scss" scoped>

</style>